Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_qpmod.c
/*
 * CDDL HEADER START
 *
 * The contents of this file are subject to the terms of the
 * Common Development and Distribution License (the "License").
 * You may not use this file except in compliance with the License.
 *
 * You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
 * or http://www.opensolaris.org/os/licensing.
 * See the License for the specific language governing permissions
 * and limitations under the License.
 *
 * When distributing Covered Code, include this CDDL HEADER in each
 * file and include the License file at usr/src/OPENSOLARIS.LICENSE.
 * If applicable, add the following below this CDDL HEADER, with the
 * fields enclosed by brackets "[]" replaced with your own identifying
 * information: Portions Copyright [yyyy] [name of copyright owner]
 *
 * CDDL HEADER END
 */

/*
 *  Copyright (c) 2010, Oracle and/or its affiliates. All rights reserved.
 */

/*
 * mcxnex_qpmod.c
 *    Mcxnex Queue Pair Modify Routines
 *
 *    This contains all the routines necessary to implement the
 *    ModifyQP() verb.  This includes all the code for legal
 *    transitions to and from Reset, Init, RTR, RTS, SQD, SQErr,
 *    and Error.
 */

#include <sys/types.h>
#include <sys/conf.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>
#include <sys/modctl.h>
#include <sys/bitmap.h>

#include "mcxnex.h"
#include <sys/ib/ib_pkt_hdrs.h>

static int mcxnex_qp_reset2init(mcxnex_state_t *state, mcxnex_qphdl_t qp,
    ibt_qp_info_t *info_p);
static int mcxnex_qp_init2init(mcxnex_state_t *state, mcxnex_qphdl_t qp,
    ibt_cep_modify_flags_t flags, ibt_qp_info_t *info_p);
static int mcxnex_qp_init2rtr(mcxnex_state_t *state, mcxnex_qphdl_t qp,
    ibt_cep_modify_flags_t flags, ibt_qp_info_t *info_p);
static int mcxnex_qp_rtr2rts(mcxnex_state_t *state, mcxnex_qphdl_t qp,
    ibt_cep_modify_flags_t flags, ibt_qp_info_t *info_p);
static int mcxnex_qp_rts2rts(mcxnex_state_t *state, mcxnex_qphdl_t qp,
    ibt_cep_modify_flags_t flags, ibt_qp_info_t *info_p);
#ifdef MCXNEX_NOTNOW
static int mcxnex_qp_rts2sqd(mcxnex_state_t *state, mcxnex_qphdl_t qp,
    ibt_cep_modify_flags_t flags);
#endif
static int mcxnex_qp_sqd2rts(mcxnex_state_t *state, mcxnex_qphdl_t qp,
    ibt_cep_modify_flags_t flags, ibt_qp_info_t *info_p);
static int mcxnex_qp_sqd2sqd(mcxnex_state_t *state, mcxnex_qphdl_t qp,
    ibt_cep_modify_flags_t flags, ibt_qp_info_t *info_p);
static int mcxnex_qp_sqerr2rts(mcxnex_state_t *state, mcxnex_qphdl_t qp,
    ibt_cep_modify_flags_t flags, ibt_qp_info_t *info_p);
static int mcxnex_qp_to_error(mcxnex_state_t *state, mcxnex_qphdl_t qp);
static int mcxnex_qp_reset2err(mcxnex_state_t *state, mcxnex_qphdl_t qp);

static uint_t mcxnex_check_rdma_enable_flags(ibt_cep_modify_flags_t flags,
    ibt_qp_info_t *info_p, mcxnex_hw_qpc_t *qpc);
static int mcxnex_qp_validate_resp_rsrc(mcxnex_state_t *state,
    ibt_qp_rc_attr_t *rc, uint_t *rra_max);
static int mcxnex_qp_validate_init_depth(mcxnex_state_t *state,
    ibt_qp_rc_attr_t *rc, uint_t *sra_max);
static int mcxnex_qp_validate_mtu(mcxnex_state_t *state, uint_t mtu);

/*
 * mcxnex_qp_modify()
 *    Context: Can be called from interrupt or base context.
 */
/* ARGSUSED */
int
mcxnex_qp_modify(mcxnex_state_t *state, mcxnex_qphdl_t qp,
    ibt_cep_modify_flags_t flags, ibt_qp_info_t *info_p,
    ibt_queue_sizes_t *actual_sz)
{
	ibt_cep_state_t		cur_state, mod_state;
	ibt_cep_modify_flags_t	okflags;
	int			status;

	/*
	 * TODO add support for SUSPEND and RESUME
	 */

	/*
	 * Lock the QP so that we can modify it atomically.  After grabbing
	 * the lock, get the current QP state.  We will use this current QP
	 * state to determine the legal transitions (and the checks that need
	 * to be performed.)
	 * Below is a case for every possible QP state.  In each case, we
	 * check that no flags are set which are not valid for the possible
	 * transitions from that state.  If these tests pass and the
	 * state transition we are attempting is legal, then we call one
	 * of the helper functions.  Each of these functions does some
	 * additional setup before posting the firmware command for the
	 * appropriate state transition.
	 */
	mutex_enter(&qp->qp_lock);

	/*
	 * Verify that the transport type matches between the serv_type and the
	 * qp_trans.  A caller to IBT must specify the qp_trans field as
	 * IBT_UD_SRV, IBT_RC_SRV, or IBT_UC_SRV, depending on the QP.  We
	 * check here that the correct value was specified, based on our
	 * understanding of the QP serv type.
	 *
	 * Because callers specify part of a 'union' based on what QP type they
	 * think they're working with, this ensures that we do not pickup bogus
	 * data if the caller thought they were working with a different QP
	 * type.
	 */
	if (!(MCXNEX_QP_TYPE_VALID(info_p->qp_trans, qp->qp_serv_type))) {
		mutex_exit(&qp->qp_lock);
		return (IBT_QP_SRV_TYPE_INVALID);
	}

	/*
	 * If this is a transition to RTS (which is valid from RTR, RTS,
	 * SQError, and SQ Drain) then we should honor the "current QP state"
	 * specified by the consumer.  This means converting the IBTF QP state
	 * in "info_p->qp_current_state" to an Mcxnex QP state.  Otherwise, we
	 * assume that we already know the current state (i.e. whatever it was
	 * last modified to or queried as - in "qp->qp_state").
	 */
	mod_state = info_p->qp_state;

	if (flags & IBT_CEP_SET_RTR_RTS) {
		cur_state = MCXNEX_QP_RTR;		/* Ready to Receive */

	} else if ((flags & IBT_CEP_SET_STATE) &&
	    (mod_state == IBT_STATE_RTS)) {

		/* Convert the current IBTF QP state to an Mcxnex QP state */
		switch (info_p->qp_current_state) {
		case IBT_STATE_RTR:
			cur_state = MCXNEX_QP_RTR;	/* Ready to Receive */
			break;
		case IBT_STATE_RTS:
			cur_state = MCXNEX_QP_RTS;	/* Ready to Send */
			break;
		case IBT_STATE_SQE:
			cur_state = MCXNEX_QP_SQERR;	/* Send Queue Error */
			break;
		case IBT_STATE_SQD:
			cur_state = MCXNEX_QP_SQD;	/* SQ Drained */
			break;
		default:
			mutex_exit(&qp->qp_lock);
			return (IBT_QP_STATE_INVALID);
		}
	} else {
		cur_state = qp->qp_state;
	}

	switch (cur_state) {
	case MCXNEX_QP_RESET:
		okflags = (IBT_CEP_SET_STATE | IBT_CEP_SET_RESET_INIT |
		    IBT_CEP_SET_RDMA_R | IBT_CEP_SET_RDMA_W |
		    IBT_CEP_SET_ATOMIC | IBT_CEP_SET_PKEY_IX |
		    IBT_CEP_SET_PORT | IBT_CEP_SET_QKEY);

