Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_qpmod.c
		/*
		 * Check for attempts to modify invalid attributes from the
		 * "SQD" state
		 */
		if (flags & ~okflags) {
			mutex_exit(&qp->qp_lock);
			status = IBT_QP_ATTR_RO;
			goto qpmod_fail;
		}

		/*
		 * Verify state transition is to either "SQD", "RTS", "Reset",
		 * or "Error"
		 */

		if ((flags & IBT_CEP_SET_STATE) &&
		    (mod_state == IBT_STATE_SQD)) {
			/*
			 * Attempt to transition from "SQD" to "SQD"
			 */
			status = mcxnex_qp_sqd2sqd(state, qp, flags, info_p);
			if (status != DDI_SUCCESS) {
				mutex_exit(&qp->qp_lock);
				goto qpmod_fail;
			}
			qp->qp_state = MCXNEX_QP_SQD;

		} else if ((flags & IBT_CEP_SET_STATE) &&
		    (mod_state == IBT_STATE_RTS)) {
			/*
			 * If still draining SQ, then fail transition attempt
			 * to RTS, even though this is now done is two steps
			 * (see below) if the consumer has tried this before
			 * it's drained, let him fail and wait appropriately
			 */
			if (qp->qp_sqd_still_draining) {
				mutex_exit(&qp->qp_lock);
				goto qpmod_fail;
			}
			/*
			 * IBA 1.2 has changed - most/all the things that were
			 * done in SQD2RTS can be done in SQD2SQD.  So make this
			 * a 2-step process.  First, set any attributes requsted
			 * w/ SQD2SQD, but no real transition.
			 *
			 * First, Attempt to transition from "SQD" to "SQD"
			 */
			status = mcxnex_qp_sqd2sqd(state, qp, flags, info_p);
			if (status != DDI_SUCCESS) {
				mutex_exit(&qp->qp_lock);
				goto qpmod_fail;
			}
			qp->qp_state = MCXNEX_QP_SQD;

			/*
			 * The, attempt to transition from "SQD" to "RTS", but
			 * request only the state transition, no attributes
			 */

			status = mcxnex_qp_sqd2rts(state, qp,
			    IBT_CEP_SET_STATE, info_p);
			if (status != DDI_SUCCESS) {
				mutex_exit(&qp->qp_lock);
				goto qpmod_fail;
			}
			qp->qp_state = MCXNEX_QP_RTS;

		} else if ((flags & IBT_CEP_SET_STATE) &&
		    (mod_state == IBT_STATE_RESET)) {
			/*
			 * Attempt to transition from "SQD" to "Reset"
			 */
			status = mcxnex_qp_to_reset(state, qp);
			if (status != DDI_SUCCESS) {
				mutex_exit(&qp->qp_lock);
				goto qpmod_fail;
			}
			qp->qp_state = MCXNEX_QP_RESET;

			/*
			 * Do any additional handling necessary for the
			 * transition _to_ the "Reset" state (e.g. update the
			 * workQ WRID lists)
			 */
			status = mcxnex_wrid_to_reset_handling(state, qp);
			if (status != IBT_SUCCESS) {
				mutex_exit(&qp->qp_lock);
				goto qpmod_fail;
			}

		} else if ((flags & IBT_CEP_SET_STATE) &&
		    (mod_state == IBT_STATE_ERROR)) {
			/*
			 * Attempt to transition from "SQD" to "Error"
			 */
			status = mcxnex_qp_to_error(state, qp);
			if (status != DDI_SUCCESS) {
				mutex_exit(&qp->qp_lock);
				goto qpmod_fail;
			}
			qp->qp_state = MCXNEX_QP_ERR;

		} else {
			/* Invalid transition - return error */
			mutex_exit(&qp->qp_lock);
			status = IBT_QP_STATE_INVALID;
			goto qpmod_fail;
		}
		break;

	case MCXNEX_QP_ERR:
		/*
		 * Verify state transition is to either "Reset" or back to
		 * "Error"
		 */
		if ((flags & IBT_CEP_SET_STATE) &&
		    (mod_state == IBT_STATE_RESET)) {
			/*
			 * Attempt to transition from "Error" to "Reset"
			 */
			status = mcxnex_qp_to_reset(state, qp);
			if (status != DDI_SUCCESS) {
				mutex_exit(&qp->qp_lock);
				goto qpmod_fail;
			}
			qp->qp_state = MCXNEX_QP_RESET;

			/*
			 * Do any additional handling necessary for the
			 * transition _to_ the "Reset" state (e.g. update the
			 * workQ WRID lists)
			 */
			status = mcxnex_wrid_to_reset_handling(state, qp);
			if (status != IBT_SUCCESS) {
				mutex_exit(&qp->qp_lock);
				goto qpmod_fail;
			}

		} else if ((flags & IBT_CEP_SET_STATE) &&
		    (mod_state == IBT_STATE_ERROR)) {
			/*
			 * Attempt to transition from "Error" back to "Error"
			 *    Nothing to do here really... just drop the lock
			 *    and return success.  The qp->qp_state should
			 *    already be set to MCXNEX_QP_ERR.
			 *
			 */
			mutex_exit(&qp->qp_lock);
			return (DDI_SUCCESS);

		} else {
			/* Invalid transition - return error */
			mutex_exit(&qp->qp_lock);
			status = IBT_QP_STATE_INVALID;
			goto qpmod_fail;
		}
		break;

	default:
		/*
		 * Invalid QP state.  If we got here then it's a warning of
		 * a probably serious problem.  So print a message and return
		 * failure
		 */
		mutex_exit(&qp->qp_lock);
		MCXNEX_WARNING(state, "unknown QP state in modify");
		status = IBT_QP_STATE_INVALID;
		goto qpmod_fail;
	}

	mutex_exit(&qp->qp_lock);
	return (DDI_SUCCESS);

qpmod_fail:
	return (status);
}


/*
 * mcxnex_qp_reset2init()
 *    Context: Can be called from interrupt or base context.
 */
static int
mcxnex_qp_reset2init(mcxnex_state_t *state, mcxnex_qphdl_t qp,
    ibt_qp_info_t *info_p)
{
	mcxnex_hw_qpc_t		*qpc;
	ibt_qp_rc_attr_t	*rc;
	ibt_qp_ud_attr_t	*ud;
	ibt_qp_uc_attr_t	*uc;
	uint_t			portnum, pkeyindx;
	int			status;
	uint32_t		cqnmask;

	ASSERT(MUTEX_HELD(&qp->qp_lock));

	/*
	 * Grab the temporary QPC entry from QP software state
	 */
	qpc = &qp->qpc;

	/*
	 * Fill in the common fields in the QPC
	 */

	if (qp->qp_is_special) {
		qpc->serv_type	= MCXNEX_QP_MLX;
	} else {
		qpc->serv_type	= qp->qp_serv_type;
	}
	qpc->pm_state		= MCXNEX_QP_PMSTATE_MIGRATED;

	qpc->pd			= qp->qp_pdhdl->pd_pdnum;

	qpc->log_sq_stride	= qp->qp_sq_log_wqesz - 4;
	qpc->log_rq_stride	= qp->qp_rq_log_wqesz - 4;
	qpc->sq_no_prefetch	= qp->qp_no_prefetch;
	qpc->log_sq_size	= highbit(qp->qp_sq_bufsz) - 1;
	qpc->log_rq_size	= highbit(qp->qp_rq_bufsz) - 1;

	qpc->usr_page		= qp->qp_uarpg;

	/* MCXNEX: sched_q is now in the address vector(s) */
	qpc->pri_addr_path.sched_q = MCXNEX_QP_SCHEDQ_GET(qp->qp_portnum,
	    0, qp->qp_is_special);
	qpc->alt_addr_path.sched_q = MCXNEX_QP_SCHEDQ_GET(qp->qp_portnum,
	    0, qp->qp_is_special);

	cqnmask = (1 << state->hs_cfg_profile->cp_log_num_cq) - 1;
	qpc->cqn_snd		= qp->qp_sq_cqhdl->cq_cqnum & cqnmask;
	qpc->page_offs		= qp->qp_wqinfo.qa_pgoffs >> 6;
	qpc->cqn_rcv		= qp->qp_rq_cqhdl->cq_cqnum & cqnmask;

	/* dbr is now an address, not an index */
	qpc->dbr_addrh		= ((uint64_t)qp->qp_rq_pdbr >> 32);
	qpc->dbr_addrl		= ((uint64_t)qp->qp_rq_pdbr & 0xFFFFFFFC) >> 2;
	qpc->sq_wqe_counter	= 0;
	qpc->rq_wqe_counter	= 0;
	/*
	 * MCXNEX:
	 * qpc->wqe_baseaddr is replaced by LKey from the cMPT, and
	 * page_offset, mtt_base_addr_h/l, and log2_page_size will
	 * be used to map the WQE buffer
	 * NOTE that the cMPT is created implicitly when the QP is
	 * transitioned from reset to init
	 */
	qpc->log2_pgsz		= qp->qp_mrhdl->mr_log2_pgsz;
	qpc->mtt_base_addrl	= (qp->qp_mrhdl->mr_mttaddr) >> 3;
	qpc->mtt_base_addrh	= (uint32_t)((qp->qp_mrhdl->mr_mttaddr >> 32) &
	    0xFF);
	qpc->srq_en		= qp->qp_srq_en;

	if (qp->qp_srq_en == MCXNEX_QP_SRQ_ENABLED) {
		qpc->srq_number	= qp->qp_srqhdl->srq_srqnum;
	} else {
		qpc->srq_number = 0;
	}

	/* 1.2 verbs extensions disabled for now */
	qpc->fre		= 0; /* default disable fast registration WR */
	qpc->rlky		= qp->qp_rlky;
	qpc->header_sep		= 0; /* disble header separation for now */
	qpc->rss		= 0; /* default disable RSS for now */
	qpc->inline_scatter	= 0; /* disable inline scatter for now */

	if (qp->qp_vlan_strip_off)
		qpc->vlan_strip_off = 1;

	if (qp->qp_link_type_eth)
		qpc->pri_addr_path.link_type = MCXNEX_QP_LINK_TYPE_ETH;

