Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_qpmod.c
	/*
	 * Now fill in the QPC fields which are specific to transport type
	 */
	if (qp->qp_serv_type == MCXNEX_QP_UD) {
		ud = &info_p->qp_transport.ud;

		/* Set the QKey */
		qpc->qkey = ud->ud_qkey;

		/*
		 * Set MTU and message max. Mcxnex checks the QPC
		 * MTU settings rather than just the port MTU,
		 * so set it to maximum size.
		 */
		qpc->mtu = MCXNEX_MAX_MTU;
		if (qp->qp_uses_lso)
			qpc->msg_max = state->hs_devlim.log_max_gso_sz;
		else
			qpc->msg_max = MCXNEX_QP_LOG_MAX_MSGSZ;

		/* Check for valid port number and fill it in */
		portnum = ud->ud_port;
		if (mcxnex_portnum_is_valid(state, portnum)) {
			qp->qp_portnum = portnum - 1;
			qpc->pri_addr_path.sched_q =
			    MCXNEX_QP_SCHEDQ_GET(portnum - 1,
			    0, qp->qp_is_special);
		} else {
			return (IBT_HCA_PORT_INVALID);
		}


		/* Check for valid PKey index and fill it in */
		pkeyindx = ud->ud_pkey_ix;
		if (mcxnex_pkeyindex_is_valid(state, pkeyindx)) {
			qpc->pri_addr_path.pkey_indx = pkeyindx;
			qp->qp_pkeyindx = pkeyindx;
		} else {
			return (IBT_PKEY_IX_ILLEGAL);
		}

	} else if (qp->qp_serv_type == MCXNEX_QP_MLX) {
		ud = &info_p->qp_transport.ud;
		portnum = ud->ud_port;

		/*
		 * TBD - Review MTU
		 *
		 */
		qpc->mtu = MCXNEX_ETH_MTU;

		qp->qp_portnum = portnum - 1;

		qpc->pri_addr_path.ack_timeout = 1 & 0x07;
		qpc->pri_addr_path.sched_q = 0x83 | ((portnum - 1) << 6);
		qpc->pri_addr_path.cntr_idx = 0;
		qpc->pri_addr_path.cvlan = 0;

		qpc->msg_max = MCXNEX_ETH_MSG_MAX;

	} else if (qp->qp_serv_type == MCXNEX_QP_RC) {
		rc = &info_p->qp_transport.rc;

		/* Set the RDMA (recv) enable/disable flags */
		qpc->rre = (info_p->qp_flags & IBT_CEP_RDMA_RD) ? 1 : 0;
		qpc->rwe = (info_p->qp_flags & IBT_CEP_RDMA_WR) ? 1 : 0;
		qpc->rae = (info_p->qp_flags & IBT_CEP_ATOMIC)  ? 1 : 0;

		/* Check for valid port number and fill it in */
		portnum = rc->rc_path.cep_hca_port_num;
		if (mcxnex_portnum_is_valid(state, portnum)) {
			qp->qp_portnum = portnum - 1;
			qpc->pri_addr_path.sched_q =
			    MCXNEX_QP_SCHEDQ_GET(portnum - 1,
			    0, qp->qp_is_special);
		} else {
			return (IBT_HCA_PORT_INVALID);
		}

		/* Check for valid PKey index and fill it in */
		pkeyindx = rc->rc_path.cep_pkey_ix;
		if (mcxnex_pkeyindex_is_valid(state, pkeyindx)) {
			qpc->pri_addr_path.pkey_indx = pkeyindx;
		} else {
			return (IBT_PKEY_IX_ILLEGAL);
		}

	} else if (qp->qp_serv_type == MCXNEX_QP_UC) {
		uc = &info_p->qp_transport.uc;

		/*
		 * Set the RDMA (recv) enable/disable flags.  Note: RDMA Read
		 * and Atomic are ignored by default.
		 */
		qpc->rwe = (info_p->qp_flags & IBT_CEP_RDMA_WR) ? 1 : 0;

		/* Check for valid port number and fill it in */
		portnum = uc->uc_path.cep_hca_port_num;
		if (mcxnex_portnum_is_valid(state, portnum)) {
			qp->qp_portnum = portnum - 1;
			qpc->pri_addr_path.sched_q =
			    MCXNEX_QP_SCHEDQ_GET(portnum - 1,
			    0, qp->qp_is_special);
		} else {
			return (IBT_HCA_PORT_INVALID);
		}

		/* Check for valid PKey index and fill it in */
		pkeyindx = uc->uc_path.cep_pkey_ix;
		if (mcxnex_pkeyindex_is_valid(state, pkeyindx)) {
			qpc->pri_addr_path.pkey_indx = pkeyindx;
		} else {
			return (IBT_PKEY_IX_ILLEGAL);
		}

	} else {
		/*
		 * Invalid QP transport type. If we got here then it's a
		 * warning of a probably serious problem.  So print a message
		 * and return failure
		 */
		MCXNEX_WARNING(state, "unknown QP transport type in rst2init");
		return (DDI_FAILURE);
	}

	/*
	 * Post the RST2INIT_QP command to the Mcxnex firmware
	 *
	 * We do a MCXNEX_NOSLEEP here because we are still holding the
	 * "qp_lock".  If we got raised to interrupt level by priority
	 * inversion, we do not want to block in this routine waiting for
	 * success.
	 */
	status = mcxnex_cmn_qp_cmd_post(state, RST2INIT_QP, qpc, qp->qp_qpnum,
	    0, DDI_NOSLEEP);
	if (status != MCXNEX_CMD_SUCCESS) {
		cmn_err(CE_NOTE, "mcxnex%d: RST2INIT_QP command failed: %08x\n",
		    state->hs_instance, status);
		if (status == MCXNEX_CMD_INVALID_STATUS) {
			mcxnex_fm_ereport(state, HCA_SYS_ERR, HCA_ERR_SRV_LOST);
		}
		return (DDI_FAILURE);
	}

	return (DDI_SUCCESS);
}


/*
 * mcxnex_qp_init2init()
 *    Context: Can be called from interrupt or base context.
 */
static int
mcxnex_qp_init2init(mcxnex_state_t *state, mcxnex_qphdl_t qp,
    ibt_cep_modify_flags_t flags, ibt_qp_info_t *info_p)
{
	mcxnex_hw_qpc_t		*qpc;
	ibt_qp_rc_attr_t	*rc;
	ibt_qp_ud_attr_t	*ud;
	ibt_qp_uc_attr_t	*uc;
	uint_t			portnum, pkeyindx;
	uint32_t		opmask = 0;
	int			status;

	ASSERT(MUTEX_HELD(&qp->qp_lock));

	/*
	 * Grab the temporary QPC entry from QP software state
	 */
	qpc = &qp->qpc;

	/*
	 * Since there are no common fields to be filled in for this command,
	 * we begin with the QPC fields which are specific to transport type.
	 */
	if (qp->qp_serv_type == MCXNEX_QP_UD) {
		ud = &info_p->qp_transport.ud;

		/*
		 * If we are attempting to modify the port for this QP, then
		 * check for valid port number and fill it in.  Also set the
		 * appropriate flag in the "opmask" parameter.
		 */
	/*
	 * set port is not supported in init2init - however, in init2rtr it will
	 * take the entire qpc, including the embedded sched_q in the path
	 * structure - so, we can just skip setting the opmask for it explicitly
	 * and allow it to be set later on
	 */
		if (flags & IBT_CEP_SET_PORT) {
			portnum = ud->ud_port;
			if (mcxnex_portnum_is_valid(state, portnum)) {
				qp->qp_portnum = portnum - 1; /* save it away */
				qpc->pri_addr_path.sched_q =
				    MCXNEX_QP_SCHEDQ_GET(portnum - 1,
				    0, qp->qp_is_special);
			} else {
				return (IBT_HCA_PORT_INVALID);
			}
		}

		/*
		 * If we are attempting to modify the PKey index for this QP,
		 * then check for valid PKey index and fill it in.  Also set
		 * the appropriate flag in the "opmask" parameter.
		 */
		if (flags & IBT_CEP_SET_PKEY_IX) {
			pkeyindx = ud->ud_pkey_ix;
			if (mcxnex_pkeyindex_is_valid(state, pkeyindx)) {
				qpc->pri_addr_path.pkey_indx = pkeyindx;
				opmask |= MCXNEX_CMD_OP_PKEYINDX;
				qp->qp_pkeyindx = pkeyindx;
			} else {
				return (IBT_PKEY_IX_ILLEGAL);
			}
		}

