Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_qpmod.c
	} else if (qp->qp_serv_type == MCXNEX_QP_MLX) {
		qpc->mtu	= MCXNEX_ETH_MTU;
		qpc->msg_max	= MCXNEX_ETH_MSG_MAX;
		qpc->pri_addr_path.pkey_indx = 0;

		qp->qp_save_mtu = qpc->mtu;
		qp->qp_pkeyindx = 0;

	} else if (qp->qp_serv_type == MCXNEX_QP_RC) {
		rc = &info_p->qp_transport.rc;
		qpc_path = &qpc->pri_addr_path;
		adds_vect = &rc->rc_path.cep_adds_vect;

		/*
		 * Set the common primary address path fields
		 */
		status = mcxnex_set_addr_path(state, adds_vect, qpc_path,
		    MCXNEX_ADDRPATH_QP);
		if (status != DDI_SUCCESS) {
			return (status);
		}
		/* set the primary port number/sched_q */
		portnum = qp->qp_portnum + 1;
		if (mcxnex_portnum_is_valid(state, portnum)) {
			qpc->pri_addr_path.sched_q  =
			    MCXNEX_QP_SCHEDQ_GET(qp->qp_portnum,
			    adds_vect->av_srvl, qp->qp_is_special);
		} else {
			return (IBT_HCA_PORT_INVALID);
		}

		/*
		 * The following values are apparently "required" here (as
		 * they are part of the IBA-defined "Remote Node Address
		 * Vector").  However, they are also going to be "required"
		 * later - at RTR2RTS_QP time.  Not sure why.  But we set
		 * them here anyway.
		 */
		qpc->rnr_retry		= rc->rc_rnr_retry_cnt;
		qpc->retry_cnt		= rc->rc_retry_cnt;
		qpc_path->ack_timeout	= rc->rc_path.cep_timeout;

		/*
		 * Setup the destination QP, recv PSN, MTU, max msg size,etc.
		 * Note max message size is defined to be the maximum IB
		 * allowed message size (which is 2^31 bytes).  Also max
		 * MTU is defined by HCA port properties.
		 */
		qpc->rem_qpn	  = rc->rc_dst_qpn;
		qpc->next_rcv_psn = rc->rc_rq_psn;
		qpc->msg_max	  = MCXNEX_QP_LOG_MAX_MSGSZ;
		qpc->ric	  = 0;
		mtu		  = rc->rc_path_mtu;

		if (mcxnex_qp_validate_mtu(state, mtu) != DDI_SUCCESS) {
			return (IBT_HCA_PORT_MTU_EXCEEDED);
		}
		qpc->mtu = mtu;

		/*
		 * Save away the MTU value.  This is used in future sqd2sqd
		 * transitions, as the MTU must remain the same in future
		 * changes.
		 */
		qp->qp_save_mtu = qpc->mtu;

		/*
		 * Though it is a "required" parameter, "min_rnr_nak" is
		 * optionally specifiable in Mcxnex.  So we force the
		 * optional flag here.
		 */
		qpc->min_rnr_nak = rc->rc_min_rnr_nak;
		opmask |= MCXNEX_CMD_OP_MINRNRNAK;

		/*
		 * Check that the number of specified "incoming RDMA resources"
		 * is valid.  And if it is, then setup the "rra_max
		 */
		if (mcxnex_qp_validate_resp_rsrc(state, rc, &rra_max) !=
		    DDI_SUCCESS) {
			return (IBT_INVALID_PARAM);
		}
		qpc->rra_max = rra_max;

		/* don't need to set up ra_buff_indx, implicit for mcxnex */

		/*
		 * If we are attempting to modify the PKey index for this QP,
		 * then check for valid PKey index and fill it in.  Also set
		 * the appropriate flag in the "opmask" parameter.
		 */
		if (flags & IBT_CEP_SET_PKEY_IX) {
			pkeyindx = rc->rc_path.cep_pkey_ix;
			if (mcxnex_pkeyindex_is_valid(state, pkeyindx)) {
				qpc->pri_addr_path.pkey_indx = pkeyindx;
				opmask |= MCXNEX_CMD_OP_PKEYINDX;
			} else {
				return (IBT_PKEY_IX_ILLEGAL);
			}
		}

		/*
		 * Check if any of the flags indicate a change in the RDMA
		 * (recv) enable/disable flags and set the appropriate flag in
		 * the "opmask" parameter
		 */
		opmask |= mcxnex_check_rdma_enable_flags(flags, info_p, qpc);

		/*
		 * Check for optional alternate path and fill in the
		 * appropriate QPC fields if one is specified
		 */
		if (flags & IBT_CEP_SET_ALT_PATH) {
			qpc_path = &qpc->alt_addr_path;
			adds_vect = &rc->rc_alt_path.cep_adds_vect;

			/* Set the common alternate address path fields */
			status = mcxnex_set_addr_path(state, adds_vect,
			    qpc_path, MCXNEX_ADDRPATH_QP);
			if (status != DDI_SUCCESS) {
				return (status);
			}
			qpc_path->ack_timeout = rc->rc_alt_path.cep_timeout;


			/*
			 * Check for valid alternate path port number and fill
			 * it in
			 */
			portnum = rc->rc_alt_path.cep_hca_port_num;
			if (mcxnex_portnum_is_valid(state, portnum)) {
				qp->qp_portnum_alt = portnum - 1;
				qpc->alt_addr_path.sched_q =
				    MCXNEX_QP_SCHEDQ_GET(portnum - 1,
				    adds_vect->av_srvl, qp->qp_is_special);
			} else {
				return (IBT_HCA_PORT_INVALID);
			}
			/*
			 * Check for valid alternate path PKey index and fill
			 * it in
			 */
			pkeyindx = rc->rc_alt_path.cep_pkey_ix;
			if (mcxnex_pkeyindex_is_valid(state, pkeyindx)) {
				qpc->alt_addr_path.pkey_indx = pkeyindx;
			} else {
				return (IBT_PKEY_IX_ILLEGAL);
			}
			opmask |= MCXNEX_CMD_OP_ALT_PATH;
		}

	} else if (qp->qp_serv_type == MCXNEX_QP_UC) {
		uc = &info_p->qp_transport.uc;
		qpc_path = &qpc->pri_addr_path;
		adds_vect = &uc->uc_path.cep_adds_vect;

		/*
		 * Set the common primary address path fields
		 */
		status = mcxnex_set_addr_path(state, adds_vect, qpc_path,
		    MCXNEX_ADDRPATH_QP);
		if (status != DDI_SUCCESS) {
			return (status);
		}

		/* set the primary port num/schedq */
		portnum = qp->qp_portnum + 1;
		if (mcxnex_portnum_is_valid(state, portnum)) {
			qpc->pri_addr_path.sched_q  =
			    MCXNEX_QP_SCHEDQ_GET(qp->qp_portnum,
			    adds_vect->av_srvl, qp->qp_is_special);
		} else {
			return (IBT_HCA_PORT_INVALID);
		}

		/*
		 * Setup the destination QP, recv PSN, MTU, max msg size,etc.
		 * Note max message size is defined to be the maximum IB
		 * allowed message size (which is 2^31 bytes).  Also max
		 * MTU is defined by HCA port properties.
		 */
		qpc->rem_qpn	  = uc->uc_dst_qpn;
		qpc->next_rcv_psn = uc->uc_rq_psn;
		qpc->msg_max	  = MCXNEX_QP_LOG_MAX_MSGSZ;
		mtu = uc->uc_path_mtu;
		if (mcxnex_qp_validate_mtu(state, mtu) != DDI_SUCCESS) {
			return (IBT_HCA_PORT_MTU_EXCEEDED);
		}
		qpc->mtu = mtu;

		/*
		 * Save away the MTU value.  This is used in future sqd2sqd
		 * transitions, as the MTU must remain the same in future
		 * changes.
		 */
		qp->qp_save_mtu = qpc->mtu;

		/*
		 * If we are attempting to modify the PKey index for this QP,
		 * then check for valid PKey index and fill it in.  Also set
		 * the appropriate flag in the "opmask" parameter.
		 */
		if (flags & IBT_CEP_SET_PKEY_IX) {
			pkeyindx = uc->uc_path.cep_pkey_ix;
			if (mcxnex_pkeyindex_is_valid(state, pkeyindx)) {
				qpc->pri_addr_path.pkey_indx = pkeyindx;
				opmask |= MCXNEX_CMD_OP_PKEYINDX;
			} else {
				return (IBT_PKEY_IX_ILLEGAL);
			}
		}

