Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_qpmod.c
		/*
		 * If we are attempting to modify the "Minimum RNR NAK" value
		 * for this QP, then fill it in and set the appropriate flag
		 * in the "opmask" parameter.
		 */
		if (flags & IBT_CEP_SET_MIN_RNR_NAK) {
			qpc->min_rnr_nak = rc->rc_min_rnr_nak;
			opmask |= MCXNEX_CMD_OP_MINRNRNAK;
		}

		/*
		 * Check for optional alternate path and fill in the
		 * appropriate QPC fields if one is specified
		 */
		if (flags & IBT_CEP_SET_ALT_PATH) {
			qpc_path = &qpc->alt_addr_path;
			adds_vect = &rc->rc_alt_path.cep_adds_vect;

			/* Set the common alternate address path fields */
			status = mcxnex_set_addr_path(state, adds_vect,
			    qpc_path, MCXNEX_ADDRPATH_QP);
			if (status != DDI_SUCCESS) {
				return (status);
			}
			qpc_path->ack_timeout = rc->rc_alt_path.cep_timeout;

			/*
			 * Check for valid alternate path port number and fill
			 * it in
			 */
			portnum = rc->rc_alt_path.cep_hca_port_num;
			if (mcxnex_portnum_is_valid(state, portnum)) {
				qp->qp_portnum_alt = portnum - 1;
				qpc->alt_addr_path.sched_q =
				    MCXNEX_QP_SCHEDQ_GET(portnum - 1,
				    adds_vect->av_srvl, qp->qp_is_special);
			} else {
				return (IBT_HCA_PORT_INVALID);
			}

			/*
			 * Check for valid alternate path PKey index and fill
			 * it in
			 */
			pkeyindx = rc->rc_alt_path.cep_pkey_ix;
			if (mcxnex_pkeyindex_is_valid(state, pkeyindx)) {
				qpc->alt_addr_path.pkey_indx = pkeyindx;
			} else {
				return (IBT_PKEY_IX_ILLEGAL);
			}
			opmask |= MCXNEX_CMD_OP_ALT_PATH;
		}

	} else if (qp->qp_serv_type == MCXNEX_QP_UC) {
		uc = &info_p->qp_transport.uc;

		/*
		 * Check if any of the flags indicate a change in the RDMA
		 * Write (recv) enable/disable and set the appropriate flag
		 * in the "opmask" parameter. Note: RDMA Read and Atomic are
		 * not valid for UC transport.
		 */
		if (flags & IBT_CEP_SET_RDMA_W) {
			qpc->rwe = (info_p->qp_flags & IBT_CEP_RDMA_WR) ? 1 : 0;
			opmask |= MCXNEX_CMD_OP_RWE;
		}

		/*
		 * If we are attempting to modify the path migration state for
		 * this QP, then check for valid state and fill it in.  Also
		 * set the appropriate flag in the "opmask" parameter.
		 */
		if (flags & IBT_CEP_SET_MIG) {
			if (uc->uc_mig_state == IBT_STATE_MIGRATED) {
				qpc->pm_state = MCXNEX_QP_PMSTATE_MIGRATED;
			} else if (uc->uc_mig_state == IBT_STATE_REARMED) {
				qpc->pm_state = MCXNEX_QP_PMSTATE_REARM;
			} else {
				return (IBT_QP_APM_STATE_INVALID);
			}
			opmask |= MCXNEX_CMD_OP_PM_STATE;
		}

		/*
		 * Check for optional alternate path and fill in the
		 * appropriate QPC fields if one is specified
		 */
		if (flags & IBT_CEP_SET_ALT_PATH) {
			qpc_path = &qpc->alt_addr_path;
			adds_vect = &uc->uc_alt_path.cep_adds_vect;

			/* Set the common alternate address path fields */
			status = mcxnex_set_addr_path(state, adds_vect,
			    qpc_path, MCXNEX_ADDRPATH_QP);
			if (status != DDI_SUCCESS) {
				return (status);
			}

			/*
			 * Check for valid alternate path port number and fill
			 * it in
			 */
			portnum = uc->uc_alt_path.cep_hca_port_num;
			if (mcxnex_portnum_is_valid(state, portnum)) {
				qp->qp_portnum_alt = portnum - 1;
				qpc->alt_addr_path.sched_q =
				    MCXNEX_QP_SCHEDQ_GET(portnum - 1,
				    adds_vect->av_srvl, qp->qp_is_special);
			} else {
				return (IBT_HCA_PORT_INVALID);
			}

			/*
			 * Check for valid alternate path PKey index and fill
			 * it in
			 */
			pkeyindx = uc->uc_alt_path.cep_pkey_ix;
			if (mcxnex_pkeyindex_is_valid(state, pkeyindx)) {
				qpc->alt_addr_path.pkey_indx = pkeyindx;
			} else {
				return (IBT_PKEY_IX_ILLEGAL);
			}
			opmask |= MCXNEX_CMD_OP_ALT_PATH;
		}
	} else {
		/*
		 * Invalid QP transport type. If we got here then it's a
		 * warning of a probably serious problem.  So print a message
		 * and return failure
		 */
		MCXNEX_WARNING(state, "unknown QP transport type in rts2rts");
		return (DDI_FAILURE);
	}

	/*
	 * Post the RTS2RTS_QP command to the Mcxnex firmware
	 *
	 * We do a MCXNEX_NOSLEEP here because we are still holding the
	 * "qp_lock".  If we got raised to interrupt level by priority
	 * inversion, we do not want to block in this routine waiting for
	 * success.
	 */
	status = mcxnex_cmn_qp_cmd_post(state, RTS2RTS_QP, qpc, qp->qp_qpnum,
	    opmask, DDI_NOSLEEP);
	if (status != MCXNEX_CMD_SUCCESS) {
		if (status != MCXNEX_CMD_BAD_QP_STATE) {
			cmn_err(CE_NOTE, "mcxnex%d: RTS2RTS_QP command failed: "
			    "%08x\n", state->hs_instance, status);
			if (status == MCXNEX_CMD_INVALID_STATUS) {
				mcxnex_fm_ereport(state, HCA_SYS_ERR,
				    HCA_ERR_SRV_LOST);
			}
			return (DDI_FAILURE);
		} else {
			return (IBT_QP_STATE_INVALID);
		}
	}

	return (DDI_SUCCESS);
}


#ifdef MCXNEX_NOTNOW
/*
 * mcxnex_qp_rts2sqd()
 *    Context: Can be called from interrupt or base context.
 */
static int
mcxnex_qp_rts2sqd(mcxnex_state_t *state, mcxnex_qphdl_t qp,
    ibt_cep_modify_flags_t flags)
{
	int			status;

	ASSERT(MUTEX_HELD(&qp->qp_lock));

	/*
	 * Set a flag to indicate whether or not the consumer is interested
	 * in receiving the SQ drained event.  Since we are going to always
	 * request hardware generation of the SQD event, we use the value in
	 * "qp_forward_sqd_event" to determine whether or not to pass the event
	 * to the IBTF or to silently consume it.
	 */
	qp->qp_forward_sqd_event = (flags & IBT_CEP_SET_SQD_EVENT) ? 1 : 0;

	/*
	 * Post the RTS2SQD_QP command to the Mcxnex firmware
	 *
	 * We do a MCXNEX_NOSLEEP here because we are still holding the
	 * "qp_lock".  If we got raised to interrupt level by priority
	 * inversion, we do not want to block in this routine waiting for
	 * success.
	 */
	status = mcxnex_cmn_qp_cmd_post(state, RTS2SQD_QP, NULL, qp->qp_qpnum,
	    0, DDI_NOSLEEP);
	if (status != MCXNEX_CMD_SUCCESS) {
		if (status != MCXNEX_CMD_BAD_QP_STATE) {
			cmn_err(CE_NOTE, "mcxnex%d: RTS2SQD_QP command failed: "
			    "%08x\n", state->hs_instance, status);
			if (status == MCXNEX_CMD_INVALID_STATUS) {
				mcxnex_fm_ereport(state, HCA_SYS_ERR,
				    HCA_ERR_SRV_LOST);
			}
			return (DDI_FAILURE);
		} else {
			return (IBT_QP_STATE_INVALID);
		}
	}

