Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_qpmod.c
/*
 * mcxnex_qp_to_reset()
 *    Context: Can be called from interrupt or base context.
 */
int
mcxnex_qp_to_reset(mcxnex_state_t *state, mcxnex_qphdl_t qp)
{
	mcxnex_hw_qpc_t	*qpc;
	int		status;

	ASSERT(MUTEX_HELD(&qp->qp_lock));

	/*
	 * Grab the temporary QPC entry from QP software state
	 */
	qpc = &qp->qpc;

	/*
	 * Post the TORST_QP command to the Mcxnex firmware
	 *
	 * We do a MCXNEX_NOSLEEP here because we are still holding the
	 * "qp_lock".  If we got raised to interrupt level by priority
	 * inversion, we do not want to block in this routine waiting for
	 * success.
	 */
	status = mcxnex_cmn_qp_cmd_post(state, TORST_QP, qpc, qp->qp_qpnum,
	    0, DDI_NOSLEEP);
	if (status != MCXNEX_CMD_SUCCESS) {
		cmn_err(CE_NOTE, "mcxnex%d: TORST_QP command failed: %08x\n",
		    state->hs_instance, status);
		if (status == MCXNEX_CMD_INVALID_STATUS) {
			mcxnex_fm_ereport(state, HCA_SYS_ERR, HCA_ERR_SRV_LOST);
		}
		return (DDI_FAILURE);
	}

	return (DDI_SUCCESS);
}


/*
 * mcxnex_qp_reset2err()
 *    Context: Can be called from interrupt or base context.
 */
static int
mcxnex_qp_reset2err(mcxnex_state_t *state, mcxnex_qphdl_t qp)
{
	mcxnex_hw_qpc_t	*qpc;
	int		status;
	uint32_t	cqnmask;

	ASSERT(MUTEX_HELD(&qp->qp_lock));

	/*
	 * In order to implement the transition from "Reset" directly to the
	 * "Error" state, it is necessary to first give ownership of the QP
	 * context to the Mcxnex hardware.  This is accomplished by
	 * transitioning the QP to "Init" as an intermediate step and then,
	 * immediately transitioning to "Error".
	 *
	 * When this function returns success, the QP context will be owned by
	 * the Mcxnex hardware and will be in the "Error" state.
	 */

	/*
	 * Grab the temporary QPC entry from QP software state
	 */
	qpc = &qp->qpc;

	/*
	 * Fill in the common fields in the QPC
	 */
	if (qp->qp_is_special) {
		qpc->serv_type	= MCXNEX_QP_MLX;
	} else {
		qpc->serv_type	= qp->qp_serv_type;
	}
	qpc->pm_state		= MCXNEX_QP_PMSTATE_MIGRATED;
	qpc->usr_page		= qp->qp_uarpg;
	/* dbr is now an address, not an index */
	qpc->dbr_addrh		= ((uint64_t)qp->qp_rq_pdbr >> 32);
	qpc->dbr_addrl		= ((uint64_t)qp->qp_rq_pdbr & 0xFFFFFFFC) >> 2;
	qpc->pd			= qp->qp_pdhdl->pd_pdnum;
	/*
	 * MCXNEX:
	 * qpc->wqe_baseaddr is replaced by LKey from the cMPT, and
	 * page_offset, mtt_base_addr_h/l, and log2_page_size will
	 * be used to map the WQE buffer
	 * NOTE that the cMPT is created implicitly when the QP is
	 * transitioned from reset to init
	 */
	qpc->log2_pgsz		= qp->qp_mrhdl->mr_log2_pgsz;
	qpc->mtt_base_addrh	= (qp->qp_mrhdl->mr_mttaddr) >> 32 & 0xFF;
	qpc->mtt_base_addrl	= (qp->qp_mrhdl->mr_mttaddr) >> 3 & 0xFFFFFFFF;
	cqnmask = (1 << state->hs_cfg_profile->cp_log_num_cq) - 1;
	qpc->cqn_snd		= qp->qp_sq_cqhdl->cq_cqnum & cqnmask;
	qpc->page_offs		= qp->qp_wqinfo.qa_pgoffs >> 6;
	qpc->cqn_rcv		= qp->qp_rq_cqhdl->cq_cqnum & cqnmask;

	qpc->sq_wqe_counter	= 0;
	qpc->rq_wqe_counter	= 0;
	qpc->log_sq_stride	= qp->qp_sq_log_wqesz - 4;
	qpc->log_rq_stride	= qp->qp_rq_log_wqesz - 4;
	qpc->log_sq_size	= highbit(qp->qp_sq_bufsz) - 1;
	qpc->log_rq_size	= highbit(qp->qp_rq_bufsz) - 1;
	qpc->srq_en		= qp->qp_srq_en;
	qpc->sq_no_prefetch	= qp->qp_no_prefetch;

	if (qp->qp_srq_en == MCXNEX_QP_SRQ_ENABLED) {
		qpc->srq_number	= qp->qp_srqhdl->srq_srqnum;
	} else {
		qpc->srq_number = 0;
	}

	qpc->fre		= 0; /* default disable fast registration WR */
	qpc->rlky		= 0; /* default disable reserved lkey */

	/*
	 * Now fill in the QPC fields which are specific to transport type
	 */
	if (qp->qp_serv_type == MCXNEX_QP_UD) {
		/* Set the UD parameters to an invalid default */
		qpc->qkey = 0;
		qpc->pri_addr_path.sched_q =
		    MCXNEX_QP_SCHEDQ_GET(0, 0, qp->qp_is_special);
		qpc->pri_addr_path.pkey_indx = 0;

	} else if (qp->qp_serv_type == MCXNEX_QP_RC) {
		/* Set the RC parameters to invalid default */
		qpc->rre = 0;
		qpc->rwe = 0;
		qpc->rae = 0;
		qpc->alt_addr_path.sched_q =
		    MCXNEX_QP_SCHEDQ_GET(0, 0, qp->qp_is_special);
		qpc->pri_addr_path.pkey_indx = 0;

	} else if (qp->qp_serv_type == MCXNEX_QP_UC) {
		/* Set the UC parameters to invalid default */
		qpc->rwe = 0;
		qpc->alt_addr_path.sched_q =
		    MCXNEX_QP_SCHEDQ_GET(0, 0, qp->qp_is_special);
		qpc->pri_addr_path.pkey_indx = 0;

	} else {
		/*
		 * Invalid QP transport type. If we got here then it's a
		 * warning of a probably serious problem.  So print a message
		 * and return failure
		 */
		MCXNEX_WARNING(state, "unknown QP transport type in rst2err");
		return (DDI_FAILURE);
	}

	/*
	 * Post the RST2INIT_QP command to the Mcxnex firmware
	 *
	 * We do a MCXNEX_NOSLEEP here because we are still holding the
	 * "qp_lock".  If we got raised to interrupt level by priority
	 * inversion, we do not want to block in this routine waiting for
	 * success.
	 */
	status = mcxnex_cmn_qp_cmd_post(state, RST2INIT_QP, qpc, qp->qp_qpnum,
	    0, DDI_NOSLEEP);
	if (status != MCXNEX_CMD_SUCCESS) {
		cmn_err(CE_NOTE, "mcxnex%d: RST2INIT_QP command failed: %08x\n",
		    state->hs_instance, status);
		if (status == MCXNEX_CMD_INVALID_STATUS) {
			mcxnex_fm_ereport(state, HCA_SYS_ERR, HCA_ERR_SRV_LOST);
		}
		return (DDI_FAILURE);
	}

	/*
	 * Now post the TOERR_QP command to the Mcxnex firmware
	 *
	 * We still do a MCXNEX_NOSLEEP here because we are still holding the
	 * "qp_lock".  Note:  If this fails (which it really never should),
	 * it indicates a serious problem in the HW or SW.  We try to move
	 * the QP back to the "Reset" state if possible and print a warning
	 * message if not.  In any case, we return an error here.
	 */
	status = mcxnex_cmn_qp_cmd_post(state, TOERR_QP, NULL, qp->qp_qpnum,
	    0, DDI_NOSLEEP);
	if (status != MCXNEX_CMD_SUCCESS) {
		cmn_err(CE_NOTE, "mcxnex%d: TOERR_QP command failed: %08x\n",
		    state->hs_instance, status);
		if (status == MCXNEX_CMD_INVALID_STATUS) {
			mcxnex_fm_ereport(state, HCA_SYS_ERR, HCA_ERR_SRV_LOST);
		}
		if (mcxnex_qp_to_reset(state, qp) != DDI_SUCCESS) {
			MCXNEX_WARNING(state, "failed to reset QP context");
		}
		return (DDI_FAILURE);
	}

	return (DDI_SUCCESS);
}


